{
  "meta": {
    "name": "DLD Lookup Mappings",
    "version": "1.0.0",
    "updated_at": "2025-10-22 08:05:52 +0700",
    "description": "Mappings for zones→agencies, laws→sections, products→species for DLD reporting form."
  },
  "zones_agencies": {
    "กลุ่มด่านกักกันสัตว์ที่ 1": [
      "ด่านกักกันสัตว์พระนครศรีอยุธยา",
      "ด่านกักกันสัตว์ลพบุรี",
      "ด่านกักกันสัตว์สุพรรณบุรี",
      "ด่านกักกันสัตว์ชัยนาท",
      "ด่านกักกันสัตว์สระบุรี",
      "ด่านกักกันสัตว์นครนายก",
      "ด่านกักกันสัตว์ปราจีนบุรี"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 2": [
      "ด่านกักกันสัตว์สระแก้ว",
      "ด่านกักกันสัตว์ตราด",
      "ด่านกักกันสัตว์จันทบุรี",
      "ด่านกักกันสัตว์บุรีรัมย์",
      "ด่านกักกันสัตว์สุรินทร์",
      "ด่านกักกันสัตว์ศรีสะเกษ"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 3": [
      "ด่านกักกันสัตว์นครราชสีมา",
      "ด่านกักกันสัตว์มหาสารคาม",
      "ด่านกักกันสัตว์ยโสธร",
      "ด่านกักกันสัตว์อุดรธานี",
      "ด่านกักกันสัตว์ขอนแก่น"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 4": [
      "ด่านกักกันสัตว์มุกดาหาร",
      "ด่านกักกันสัตว์นครพนม",
      "ด่านกักกันสัตว์หนองคาย",
      "ด่านกักกันสัตว์อุบลราชธานี",
      "ด่านกักกันสัตว์เลย"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 5": [
      "ด่านกักกันสัตว์เชียงใหม่",
      "ด่านกักกันสัตว์ลำพูน",
      "ด่านกักกันสัตว์ลำปาง",
      "ด่านกักกันสัตว์แพร่"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 6": [
      "ด่านกักกันสัตว์เชียงราย",
      "ด่านกักกันสัตว์พะเยา",
      "ด่านกักกันสัตว์น่าน",
      "ด่านกักกันสัตว์อุตรดิตถ์",
      "ด่านกักกันสัตว์แม่ฮ่องสอน",
      "ด่านกักกันสัตว์ตาก"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 7": [
      "ด่านกักกันสัตว์พิษณุโลก",
      "ด่านกักกันสัตว์พิจิตร",
      "ด่านกักกันสัตว์เพชรบูรณ์",
      "ด่านกักกันสัตว์นครสวรรค์",
      "ด่านกักกันสัตว์กำแพงเพชร"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 8": [
      "ด่านกักกันสัตว์เพชรบุรี",
      "ด่านกักกันสัตว์ราชบุรี",
      "ด่านกักกันสัตว์กาญจนบุรี",
      "ด่านกักกันสัตว์ประจวบคีรีขันธ์",
      "ด่านกักกันสัตว์ชุมพร"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 9": [
      "ด่านกักกันสัตว์สงขลา",
      "ด่านกักกันสัตว์นราธิวาส",
      "ด่านกักกันสัตว์นครศรีธรรมราช",
      "ด่านกักกันสัตว์ท่าอากาศยานนานาชาติสมุย"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 10": [
      "ด่านกักกันสัตว์สตูล",
      "ด่านกักกันสัตว์ภูเก็ต",
      "ด่านกักกันสัตว์ตรัง",
      "ด่านกักกันสัตว์ระนอง"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 11": [
      "ด่านกักกันสัตว์ชลบุรี",
      "ด่านกักกันสัตว์ท่าอากาศยานสุวรรณภูมิ",
      "ด่านกักกันสัตว์ท่าอากาศยานดอนเมือง",
      "ด่านกักกันสัตว์ลาดกระบัง"
    ],
    "กลุ่มด่านกักกันสัตว์ที่ 12": [
      "ด่านกักกันสัตว์ท่าเรือกรุงเทพ",
      "ด่านกักกันสัตว์ไปรษณีย์กรุงเทพฯ",
      "ด่านกักกันสัตว์นครปฐม",
      "ด่านกักกันสัตว์ฉะเชิงเทรา"
    ],
    "ชุดเฉพาะกิจส่วนกลาง": [
      "ชุดเฉพาะกิจพญาไท",
      "ชุดเฉพาะกิจพญานาคราช"
    ],
    "กองสารวัตรและกักกัน": [
      "กองสารวัตรและกักกัน"
    ]
  },
  "laws_sections": {
    "พ.ร.บ.โรคระบาดสัตว์ พ.ศ.2558": [
      "ม.18 - เคลื่อนย้ายสัตว์/ซากสัตว์เข้า–ผ่านเขตควบคุมโรคระบาดโดยไม่มีอนุญาต",
      "ม.21 - ฝ่าฝืนประกาศผู้ว่าฯ เขตโรคระบาด/เฝ้าระวัง",
      "ม.22 - เคลื่อนย้ายในเขตโรคระบาดโดยไม่มีใบอนุญาต",
      "ม.24 - ค้าสัตว์/ซากสัตว์โดยไม่มีใบอนุญาต",
      "ม.25 - จำหน่ายน้ำเชื้อ/เอ็มบริโอโดยไม่มีใบอนุญาต",
      "ม.31 - นำเข้า/ส่งออก/นำผ่านสัตว์หรือซากโดยไม่มีใบอนุญาต",
      "ม.34 - เคลื่อนย้ายข้ามจังหวัดโดยไม่มีใบอนุญาต/ไม่ทำเครื่องหมาย",
      "ม.35 - ไม่ผ่านด่านกักกันสัตว์ตามที่กำหนด"
    ],
    "พ.ร.บ.สถานพยาบาลสัตว์ พ.ศ.2533": [
      "ม.7 - จัดตั้งสถานพยาบาลสัตว์โดยไม่ได้รับอนุญาต",
      "ม.9 - ดำเนินการสถานพยาบาลสัตว์โดยไม่ได้รับอนุญาต",
      "ม.23 - ปล่อยให้บุคคลที่ไม่ใช่สัตวแพทย์ประกอบวิชาชีพการสัตวแพทย์ในสถานพยาบาลสัตว์"
    ],
    "พ.ร.บ.ควบคุมการฆ่าสัตว์และจำหน่ายเนื้อสัตว์ พ.ศ.2559": [
      "ม.15 - ฆ่าสัตว์โดยไม่มีใบอนุญาต",
      "ม.31 - ไม่แจ้งฆ่าสัตว์",
      "ม.33 - นำสัตว์ออกจากโรงฆ่าโดยไม่ได้รับอนุญาต",
      "ม.35 - นำเนื้อออกก่อนรับรอง",
      "ม.37 - ชำแหละหรือตัดแต่งโดยไม่รับรอง",
      "ม.38 - จำหน่ายเนื้อที่ไม่ได้รับรอง",
      "ม.39 - ฆ่าสัตว์นอกโรงฆ่า"
    ],
    "พ.ร.บ.ควบคุมคุณภาพอาหารสัตว์ พ.ศ.2558": [
      "ม.6(4) - ใช้วัตถุที่ห้ามใช้ผสมในอาหารสัตว์",
      "ม.15 - ผลิตเพื่อขาย หรือนำเข้าเพื่อขายอาหารสัตว์ควบคุมเฉพาะโดยไม่ได้รับใบอนุญาต",
      "ม.17 - ขายอาหารสัตว์ควบคุมเฉพาะโดยไม่ได้รับใบอนุญาต",
      "ม.56(2) - ผลิตเพื่อขายหรือนำเข้าเพื่อขายอาหารสัตว์เสื่อมคุณภาพ",
      "ม.56(2) - ขายอาหารสัตว์เสื่อมคุณภาพ",
      "ม.56(4) - ผลิตเพื่อขาย หรือนำเข้าอาหารสัตว์ที่ต้องขึ้นทะเบียนแต่ไม่ได้ขึ้นทะเบียน",
      "ม.56(4) - ขายอาหารสัตว์ที่ต้องขึ้นทะเบียนแต่ไม่ได้ขึ้นทะเบียน"
    ],
    "พ.ร.บ.วิชาชีพการสัตวแพทย์ พ.ศ.2545": [
      "ม.29 - ประกอบวิชาชีพการสัตวแพทย์โดยไม่ได้รับอนุญาต",
      "ม.30 - แสดงให้ผู้อื่นเข้าใจว่าตนมีสิทธิ์ประกอบวิชาชีพการสัตวแพทย์"
    ],
    "พ.ร.บ.ป้องกันการทารุณกรรมและจัดสวัสดิภาพสัตว์ พ.ศ.2557": [
      "ม.20 - ทำร้ายสัตว์โดยไม่จำเป็น",
      "ม.21 - ทอดทิ้งสัตว์ให้ทุกข์ทรมาน",
      "ม.22 - บังคับสัตว์ทำงานเกินกำลัง",
      "ม.23 - ใช้สัตว์ในการแสดงที่ทารุณ",
      "ม.24 - ไม่จัดสวัสดิภาพสัตว์ตามมาตรฐาน",
      "ม.25 - ขนส่งสัตว์โดยไม่เหมาะสม",
      "ม.26 - ฆ่าสัตว์โดยวิธีทารุณ",
      "ม.27 - ขัดขวางการตรวจสอบของเจ้าหน้าที่"
    ],
    "พ.ร.บ.ยา พ.ศ.2510": [
      "ม.12 - ผลิต ขาย หรือนำหรือสั่งเข้ามาในราชอาณาจักรซึ่งยาแผนปัจจุบันโดยไม่ได้รับใบอนุญาต",
      "ม.72(3) - ผลิต ขาย หรือนำหรือสั่งเข้ามาในราชอาณาจักรซึ่งยาเสื่อมคุณภาพ",
      "ม.72(4) - ผลิต ขาย หรือนำหรือสั่งเข้ามาในราชอาณาจักรซึ่งยาที่มิได้ขึ้นทะเบียนตำรับยา"
    ],
    "พ.ร.บ.อาหาร พ.ศ.2522": [
      "ม.25(1) - ผลิต นำเข้าเพื่อจำหน่าย หรือจำหน่ายอาหารไม่บริสุทธิ์"
    ]
  },
  "products_species": {
    "สัตว์": [
      "ไก่",
      "เป็ด",
      "ห่าน",
      "นกกระทา",
      "นกแก้ว",
      "สุกร",
      "โค",
      "กระบือ",
      "แพะ",
      "แกะ",
      "กวาง",
      "กระรอก",
      "กบ",
      "ปลา",
      "กุ้ง",
      "ปู",
      "หอย",
      "แมลง",
      "สัตว์เลี้ยงแปลก"
    ],
    "ซากสัตว์": [
      "ซากไก่",
      "ซากเป็ด",
      "ซากห่าน",
      "ซากนกกระทา",
      "ซากสุกร",
      "ซากโค",
      "ซากกระบือ",
      "ซากแพะ",
      "ซากแกะ",
      "ซากกวาง",
      "ซากกระรอก",
      "ซากกบ",
      "ซากปลา",
      "ซากกุ้ง",
      "ซากปู",
      "ซากหอย",
      "ซากแมลง"
    ],
    "เนื้อสัตว์": [
      "เนื้อไก่",
      "เนื้อเป็ด",
      "เนื้อห่าน",
      "เนื้อนกกระทา",
      "เนื้อหมู",
      "เนื้อวัว",
      "เนื้อกระบือ",
      "เนื้อแพะ",
      "เนื้อแกะ",
      "เนื้อกวาง",
      "เนื้อกระรอก",
      "เนื้อกบ",
      "เนื้อปลา",
      "เนื้อกุ้ง",
      "เนื้อปู",
      "เนื้อหอย",
      "เนื้อแมลง",
      "ไข่ไก่",
      "ไข่เป็ด",
      "ไข่ห่าน",
      "ไข่นกกระทา"
    ],
    "ผลิตภัณฑ์": [
      "นม",
      "เนย",
      "เนยแข็ง",
      "โยเกิร์ต",
      "ไอศกรีม",
      "ไส้กรอก",
      "แฮม",
      "เบคอน",
      "หมูยอ",
      "หมูหยอง",
      "ปลาร้า",
      "กะปิ",
      "น้ำปลา",
      "ซอสปรุงรส",
      "เจลาติน",
      "คอลลาเจน",
      "น้ำมันปลา",
      "ผงโปรตีน",
      "อาหารสัตว์เลี้ยง"
    ],
    "ยา": [
      "ยาปฏิชีวนะ",
      "ยาฮอร์โมน",
      "วัคซีน",
      "ยาฆ่าเชื้อ",
      "ยาบำรุง",
      "ยาระงับปวด",
      "ยาแก้อักเสบ",
      "ยาขับพยาธิ",
      "ยาฆ่าแมลง",
      "ยาฆ่าเชื้อรา",
      "สารเสริมอาหาร",
      "วิตามิน",
      "เกลือแร่",
      "โปรไบโอติก",
      "เอนไซม์",
      "กรดอะมิโน",
      "ยาสลบ",
      "ยาระงับความรู้สึก"
    ],
    "อาหารสัตว์": [
      "อาหารไก่",
      "อาหารเป็ด",
      "อาหารสุกร",
      "อาหารโค",
      "อาหารกระบือ",
      "อาหารแพะ",
      "อาหารแกะ",
      "อาหารปลา",
      "อาหารกุ้ง",
      "อาหารสุนัข",
      "อาหารแมว",
      "อาหารนก",
      "อาหารกระต่าย",
      "อาหารม้า",
      "ข้าวโพด",
      "ข้าวสาลี",
      "ถั่วเหลือง",
      "รำข้าว",
      "กากถั่วเหลือง",
      "ปลาป่น",
      "กระดูกป่น",
      "เลือดป่น",
      "ใบมันสำปะหลัง",
      "หญ้าแห้ง",
      "ฟางข้าว"
    ]
  }
}